/********************************Copyright (c)**********************************\
**
**                   (c) Copyright 2021, Main, China, QD.
**                           All Rights Reserved
**
**                           By(菏泽学院——————301)
**                           http://
**
**----------------------------------文件信息------------------------------------
** 文件名称: My_WiFi.h
** 创建人员: Main
** 创建日期: 2021-05-05
** 文档描述:
**
**----------------------------------版本信息------------------------------------
** 版本代号: V0.1
** 版本说明: 初始版本
**
**------------------------------------------------------------------------------
\********************************End of Head************************************/
#ifndef MyWiFi_H_
#define MyWiFi_H_
#include <WiFi.h>

class My_WiFi
{
public:                              // 公有成员
    char AP_SSID[10];
    char AP_PSK[10];
    My_WiFi(const char *AP_SSID, const char *AP_PSK);
    void Init();
};


#endif /* MyWiFi_H_ */
